#include <iostream> // підключення бібліотеки для роботи з введенням/виведенням
#include <Windows.h> // підключення бібліотеки для налаштування кодування в консолі
#include "task1.h" // заголовковий файл для першого завдання
#include "task2.h"  // заголовковий файл для другого і третього завдань
using namespace std;

int main() {
	SetConsoleOutputCP(1251);
    int menu;

    do { // початок циклу
        // Виведення меню з варіантами завдань
        cout << "Оберіть завдання:\n\t1 - Функція SubHour.\n\t2 - Визначення радіуса кола та площі круга.\n\t3 - Перевірити непарність введенноо числа." << endl;
        cin >> menu; // зчитування вибору користувача

        switch (menu) { // обробка вибору
        case 1:
            cout << "\n=== 1: функція SubHour ===\n"; // вивід заголовку і запуск функції з task1.h для обчислення радіуса і площі круга
            RunTimeTask(); // виклик функції для першого завдання
            break;
        case 2:
            cout << "\n=== 2: РАДІУС І ПЛОЩА ===\n";  // вивід заголовку і запуск функції з task2.h
            Circle_function(); // виклик функції для другого завдання
            break;
        case 3:
            cout << "\n=== 3: ПЕРЕВІРКА неПАРНОСТІ ===\n";  // вивід заголовку і запуск функції для перевірки непарності числа
            Numbercheck_function(); // виклик функції для третього завдання
            break;
        case -1: // вихід з програми
            cout << "Вихід..." << endl;
            break;
        default:
            cout << "\n!!!Обирати можна тільки з наведених вище чисел!!!\n"; // повідомлення про помилковий вибір
        }

        cout << endl;  
        cout << "+---------------------+" << endl; // строка задля полегшення візуального сприймання тексту
        cout << endl;
    } while (menu != -1); // повторювати меню, поки користувач не введе -1
}
