#include <iostream>  // підключення бібліотеки для вводу/виводу
#include "task2.h" // підключення заголовкового файлу для другого і третього завдань
using namespace std;

// реалізація методів Circle
void Circle::input() { // функція введення
    cout << "Введіть довжину кола L: "; // введення довжини кола 
    cin >> L; // зчитування довжини кола від користувача
    if (cin.fail() || L <= 0) {  // перевірка,чи дійсне число і чи більше нуля
        cin.clear(); // скидає помилку
        cin.ignore(1000, '\n'); // очищає буфер
        // виведення сповіщення про помилку
        cout << "Недійсне введення. Довжина має бути більше за 0. За замовчуванням встановлено L = 1.\n";
        L = 1; // значення за замовчуванням, якщо введення було некоректним
    }
}

void Circle::calculate() { // функція розрахунку
    R = L / (2 * PI); // обчислення радіуса за формулою: R = L / (2π)
    S = PI * R * R; // обчислення площі круга: S = πR²
}

void Circle::output() { // функція виведення
    cout << "Радіус R = " << R << endl; // виведення радіуса
    cout << "Площа S = " << S << endl; // виведення площі
}

// реалізація методів NumberCheck
void NumberCheck::input() { // функція введення
    cout << "Введіть число A: "; // введення числа A
    cin >> A; // зчитування числа
    cin.ignore(1000, '\n'); // очищає буфер, якщо число не ціле
}

void NumberCheck::calculate() { // функція розрахунку
    isOdd = (A % 2 != 0); // перевірка на парність числа
}

void NumberCheck::output() { // функція виведення
    cout << "Число " << A << (isOdd ? " непарне." : " парне.") << endl; // виведення результату перевірки
}

void Circle_function() { // функція для обробки задачі з колом
    Circle c;
    c.input(); // введення даних
    c.calculate(); // обчислення параметрів
    c.output(); // виведення результатів
}

void Numbercheck_function() { // функція для обробки задачі з перевіркою числа на непарність
    NumberCheck num;
    num.input(); // введення даних
    num.calculate(); // обчислення параметрів
    num.output(); // виведення результатів
}
