#include <iostream> // підключення стандартної бібліотеки для вводу/виводу
using namespace std;

const float PI = 3.14; // константа, число пі

struct Circle { // структура для кола 
    float L, R, S; // L — довжина кола, R — радіус, S — площа круга
    void input(); // метод для зчитування довжини кола 
    void calculate(); // метод для обчислення радіуса та площі на основі введеної довжини
    void output(); // метод для виведення результатів обчислень
};

struct NumberCheck { // структура для перевірки числа на непарність 
    int A; 
    bool isOdd;
    void input(); // метод для зчитування числа
    void calculate(); // метод для перевірки, чи є число непарним
    void output(); // метод для виведення результату перевірки
};

void Circle_function(); // функція запускає обробку задачі з колом
void Numbercheck_function(); // функція запускає обробку задачі з перевіркою числа на непарність
